Merge pull request #161 from slowdini/dev
Release v0.1.5
